hacker/_posts/2017-01-25-A DSL For Git And Projectile Ignore File.org
 #+OPTIONS: H:2 num:nil tags:nil timestamp:t
#+BEGIN_EXPORT html
---
title: A DSL For Git And Projectile Ignore File
tagline: Check out this new post
blog-category: hacker
category:
- hacker
- exploration
tag:
- hacker
- magit
- projectile
- dsl
- elisp
---
#+END_EXPORT

* Problem

  After writing some [[https://duckduckgo.com/l/?kh=-1&uddg=https%253A%252F%252Fgithub.com%252Fbbatsov%252Fprojectile][projectile]] glue and =.projectile= and =.gitignore=
  files, I thought to myself if I could write code to generate those
  files. A DSL so to say. The reason is three-fold:

  - Write a simple ignore file structure as Elisp code
  - Allow Elisp variables for dynamic and reusable sections
  - Have a hand in writing a generic DSL

  Aside from my hacking sensibilities, the key concerns of doing so may
  be put as:

  - Maintaining two ignore files when it is just really one with a
    different syntax
  - You cannot reuse blocks of repeating sections with different files

  The former is syntactic separation while the later is flexibility and
  reusability. For my use case with Elisp, I have two projects: my Emacs
  configuration and my [[https://github.com/FrancisMurillo/org-jekyll-blogger.el][org-jekyll-blogger.el]] blog project. Using =git=
  and =projectile=, I have to more or less copy my ignore files and
  tweak it a bit. To address this, I created my own DSL =magin= to
  handle =.gitignore= files; =.projectile= is similar in intent but
  =magin= was the library I had in mind as proof.

  As an example, this is my [[https://github.com/FrancisMurillo/.emacs.d][.emacs.d]] =.gitignore=:

  #+BEGIN_SRC text
    # Base files
    config.el
    personal.el

    # Base directory
    .cache
    extra

    # Project specific
    working-config.org
    my-macros.el

    # Library
    lib/sandbox
    lib/packages
    !lib/modules
    !lib/scripts

    # Block for gtags
    GPATH
    GTAGS
    GRTAGS

    # Block for emacs
    ,*.elc
    .#*
    ,*Org Src*
  #+END_SRC

  It is generated by this DSL:

  #+BEGIN_SRC emacs-lisp
    (magin-write-to-project
     `(delimited ;; Context keyword that separates contexts by newlines

       (context ;; Represents a semantic group
        (comment "Base files") ;; A comment keyword
        (file ,(format "%s.el" (file-name-base fn/config-file))) ;; A file keyword
        (file ,(format "%s.el" (file-name-base fn/personal-file)))) ;; Notice I use a Elisp variable

       (context
        (comment "Base directory") ;; Generates "# Base directory"
        (dir ".cache") ;; A dir keyword
        (dir "extra")) ;; An alias to file but it indicates intends for a directory

       (context ;
        (comment "Project specific")
        (file "working-config.org")

        (file  ,(format "%s.el" (file-name-base fmk/macro-file))))


       (context
        (comment "Library")
        (path ;; Represents a path prefix
         "lib" ;; Everything underneath is generated with a "lib" prefix
         (context
          (dir "sandbox")
          (dir "packages"))
         (include
          (dir "modules")
          (dir "scripts"))))

       (block gtags) ;; Reusable blocks
       (block emacs))
     user-emacs-directory ;; Rewrites =.gitginore= of `user-emacs-directory'
     )
  #+END_SRC

  I do hope the DSL is easy to digest. Here are the two libraries for
  the interested: [[https://gist.github.com/e5b667a8640ba1052138ac9ec5d50ed4][magin]] and [[https://gist.github.com/82a3440565a6794327ed74685ba9902f][projin]]. If you stay around, I'd like to
  discuss the following concepts in crafting it:

  - Backquote
  - Dispatching
  - Implicit Environment

* Backquoting

  The reason why I was confident in making this DSL is due to thanks to
  [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Backquote.html][backquoting]]: it mixes the use of quoting and expressions in a Lispy
  way. I point you to understand [[https://www.gnu.org/software/emacs/manual/html_node/elisp/Quoting.html][quoting]] before proceeding, but as a
  quick brush it is using list of symbols as data.

  As an example of quoting:

  #+BEGIN_SRC emacs-lisp
    (+ 1 2 3) ;; 6

    '(+ 1 2 3)         ;; (+ 1 2 3)
    (quote (+ 1 2 3e))


    (subject linking-verb adjective)  ;; Missing symbols
    '(subject linking-verb adjective) ;; As is
  #+END_SRC

  It also allows for lazy evaluation, the problem arises when we want to
  integrate Elisp variables into the equation:

  #+BEGIN_SRC emacs-lisp
    (setq left 1
       right 2)

    (+ left right) ;; 3

    (+ 1 right)    ;; 3
    '(+ 1 right)   ;; (+ 1 right)

    ;; Using backquotes
    `(+ 1 ,right)           ;; (+ 1 2)
    `(+ 1 ,(+ left right))  ;; (+ 1 3)

    ;; Evaluating the actual value
    (eval `(+ 1 ,(+ left right)))  ;; 4
  #+END_SRC

  The complicated approach would ask us to create a tokenizer, parser
  and compiler while managing text matching and all that jazz; lispy
  data structures allows us to bypass this through the quoting. Without
  needing anymore, we can create a quoted structures that integrates
  with Elisp without any hastle.

* Domain Syntax

  So in thinking of the DSL, let us understand what the domain is. Our
  domain of abstraction is [[https://git-scm.com/docs/gitignore][gitignore]]. After some thinking and reading,
  this is the abstraction I want to address:

  - Files and directories have no distinction
  - Comments
  - Path context
  - Separators
  - Inclusion
  - Reusable blocks or groups

  There are other such abstraction I wish not cover:

  - Quoting or escaping
  - Glob keywords, as in =rx.el=, for single or double asterisk

  A DSL that is good enough to accomplish the above is good enough
  without being too abstract. Without stretching too much, this DSL has
  no intermediate output, it translates directly to text. This tradeoff
  loses flexibility in output but at least it is easier. If you wanted,
  the DSL can be mechanically a list of plists with a main text
  manipulated by several properties as such:

  #+BEGIN_SRC emacs-lisp
    (magin--compiler
     (path "glob"
           (include
            (file "foo.bar")
            (path "gib"
                  (dir "foo-bar")))))

    ;; This hypothetically might yield
    '((:line "foo.bar" :include t :parent "glob")
      (:line "foo-bar" :include t :parent "glob/gib"))
  #+END_SRC

  Without much complexity aside, we can start with hacking with the
  simple syntax.

