hacker/_posts/2017-01-25-A DSL For Git And Projectile Ignore File.html
---
title: A DSL For Git And Projectile Ignore File
tagline: Check out this new post
blog-category: hacker
category:
- hacker
- exploration
tag:
- hacker
- magit
- projectile
- dsl
- elisp
---

<div id="outline-container-org50da781" class="outline-2">
<h2 id="org50da781">Problem</h2>
<div class="outline-text-2" id="text-org50da781">
<p>
After writing some <a href="https://duckduckgo.com/l/?kh=-1&amp;uddg=https%3A%2F%2Fgithub.com%2Fbbatsov%2Fprojectile">projectile</a> glue and <code>.projectile</code> and <code>.gitignore</code>
files, I thought to myself if I could write code to generate those
files. A DSL so to say. The reason is three-fold:
</p>

<ul class="org-ul">
<li>Write a simple ignore file structure as Elisp code</li>
<li>Allow Elisp variables for dynamic and reusable sections</li>
<li>Have a hand in writing a generic DSL</li>
</ul>

<p>
Aside from my hacking sensibilities, the key concerns of doing so may
be put as:
</p>

<ul class="org-ul">
<li>Maintaining two ignore files when it is just really one with a
different syntax</li>
<li>You cannot reuse blocks of repeating sections with different files</li>
</ul>

<p>
The former is syntactic separation while the later is flexibility and
reusability. For my use case with Elisp, I have two projects: my Emacs
configuration and my <a href="https://github.com/FrancisMurillo/org-jekyll-blogger.el">org-jekyll-blogger.el</a> blog project. Using <code>git</code>
and <code>projectile</code>, I have to more or less copy my ignore files and
tweak it a bit. To address this, I created my own DSL <code>magin</code> to
handle <code>.gitignore</code> files; <code>.projectile</code> is similar in intent but
<code>magin</code> was the library I had in mind as proof.
</p>

<p>
As an example, this is my <a href="https://github.com/FrancisMurillo/.emacs.d">.emacs.d</a> <code>.gitignore</code>:
</p>

<div class="org-src-container">
<pre class="src src-text"># Base files
config.el
personal.el

# Base directory
.cache
extra

# Project specific
working-config.org
my-macros.el

# Library
lib/sandbox
lib/packages
!lib/modules
!lib/scripts

# Block for gtags
GPATH
GTAGS
GRTAGS

# Block for emacs
*.elc
.#*
*Org Src*
</pre>
</div>

<p>
It is generated by this DSL:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(magin-write-to-project
 `(delimited ;; Context keyword that separates contexts by newlines

   (context ;; Represents a semantic group
    (comment "Base files") ;; A comment keyword
    (file ,(format "%s.el" (file-name-base fn/config-file))) ;; A file keyword
    (file ,(format "%s.el" (file-name-base fn/personal-file)))) ;; Notice I use a Elisp variable

   (context
    (comment "Base directory") ;; Generates "# Base directory"
    (dir ".cache") ;; A dir keyword
    (dir "extra")) ;; An alias to file but it indicates intends for a directory

   (context ;
    (comment "Project specific")
    (file "working-config.org")

    (file  ,(format "%s.el" (file-name-base fmk/macro-file))))


   (context
    (comment "Library")
    (path ;; Represents a path prefix
     "lib" ;; Everything underneath is generated with a "lib" prefix
     (context
      (dir "sandbox")
      (dir "packages"))
     (include
      (dir "modules")
      (dir "scripts"))))

   (block gtags) ;; Reusable blocks
   (block emacs))
 user-emacs-directory ;; Rewrites =.gitginore= of `user-emacs-directory'
 )
</pre>
</div>

<p>
I do hope the DSL is easy to digest. Here are the two libraries for
the interested: <a href="https://gist.github.com/e5b667a8640ba1052138ac9ec5d50ed4">magin</a> and <a href="https://gist.github.com/82a3440565a6794327ed74685ba9902f">projin</a>. If you stay around, I'd like to
discuss the following concepts in crafting it:
</p>

<ul class="org-ul">
<li>Backquote</li>
<li>Dispatching</li>
<li>Implicit Environment</li>
</ul>
</div>
</div>

<div id="outline-container-org38c908d" class="outline-2">
<h2 id="org38c908d">Backquoting</h2>
<div class="outline-text-2" id="text-org38c908d">
<p>
The reason why I was confident in making this DSL is due to thanks to
<a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Backquote.html">backquoting</a>: it mixes the use of quoting and expressions in a Lispy
way. I point you to understand <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Quoting.html">quoting</a> before proceeding, but as a
quick brush it is using list of symbols as data.
</p>

<p>
As an example of quoting:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(+ 1 2 3) ;; 6

'(+ 1 2 3)         ;; (+ 1 2 3)
(quote (+ 1 2 3e))


(subject linking-verb adjective)  ;; Missing symbols
'(subject linking-verb adjective) ;; As is
</pre>
</div>

<p>
It also allows for lazy evaluation, the problem arises when we want to
integrate Elisp variables into the equation:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq left 1
   right 2)

(+ left right) ;; 3

(+ 1 right)    ;; 3
'(+ 1 right)   ;; (+ 1 right)

;; Using backquotes
`(+ 1 ,right)           ;; (+ 1 2)
`(+ 1 ,(+ left right))  ;; (+ 1 3)

;; Evaluating the actual value
(eval `(+ 1 ,(+ left right)))  ;; 4
</pre>
</div>

<p>
The complicated approach would ask us to create a tokenizer, parser
and compiler while managing text matching and all that jazz; lispy
data structures allows us to bypass this through the quoting. Without
needing anymore, we can create a quoted structures that integrates
with Elisp without any hastle.
</p>
</div>
</div>

<div id="outline-container-orgc8d45d4" class="outline-2">
<h2 id="orgc8d45d4">Domain Syntax</h2>
<div class="outline-text-2" id="text-orgc8d45d4">
<p>
So in thinking of the DSL, let us understand what the domain is. Our
domain of abstraction is <a href="https://git-scm.com/docs/gitignore">gitignore</a>. After some thinking and reading,
this is the abstraction I want to address:
</p>

<ul class="org-ul">
<li>Files and directories have no distinction</li>
<li>Comments</li>
<li>Path context</li>
<li>Separators</li>
<li>Inclusion</li>
<li>Reusable blocks or groups</li>
</ul>

<p>
There are other such abstraction I wish not cover:
</p>

<ul class="org-ul">
<li>Quoting or escaping</li>
<li>Glob keywords, as in <code>rx.el</code>, for single or double asterisk</li>
</ul>

<p>
A DSL that is good enough to accomplish the above is good enough
without being too abstract. Without stretching too much, this DSL has
no intermediate output, it translates directly to text. This tradeoff
loses flexibility in output but at least it is easier. If you wanted,
the DSL can be mechanically a list of plists with a main text
manipulated by several properties as such:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(magin--compiler
 (path "glob"
       (include
        (file "foo.bar")
        (path "gib"
              (dir "foo-bar")))))

;; This hypothetically might yield
'((:line "foo.bar" :include t :parent "glob")
  (:line "foo-bar" :include t :parent "glob/gib"))
</pre>
</div>

<p>
Without much complexity aside, we can start with hacking with the
simple syntax.
</p>
</div>
</div>
