hacker/_posts/2017-01-25-A DSL For Git And Projectile Ignore File.org
* Keywords

  At last, we define our data structure:

  #+BEGIN_SRC emacs-lisp
    ;; The leaf keywords
    (file ,line)
    (dir ,line) ;; Alias for file

    ;; Non functional nodes
    (comment ,text)
    (newline)


    ;; Syntactic grouping, the equivalent of progn
    (context &rest ,sublines)

    ;; Contextual grouping, like `context' but affects everything inside it
    ;; Sublines have the property `:include' as `t'
    ;; Which tells the leaf node to add `!' as a prefix
    (include &rest ,sublines)

    ;; Sublines have the property `:path' set to `path'
    ;; Nesting of paths are handled
    (path ,path &rest sublines)


    ;; Block keywords
    ;; Create a variable
    (defblock ,block-name &rest block-lines)

    ;; Call the variable
    (block ,block-name)


    ;; Aesthetic grouping
    ;; Every subline is interleaved with a newline
    (delimited &rest ,sublines)
  #+END_SRC

  Those are the keywords that we must handle in our DSL. With this in
  mind, we can start be creating a function that handles the
  compilation.

  #+BEGIN_SRC emacs-lisp
    (defun magin--compiler (dsl &optional env)
      "Compiles DSL with the environment ENV."
      nil)
  #+END_SRC

  This is our DSL handler, every node that wants to compile nodes have
  to go through this dispatching function. This setup allows us to add
  more keywords independently of each other. However, we are not going
  to use a long =switch= or =cond= statement; we will use the implicit
  Elisp environment to find handlers. If the compiler comes to a
  keyword, it finds a function in the Elisp environment that starts with
  =magit--dsl-= and invokes that as a handler.

  #+BEGIN_SRC emacs-lisp
    (defun magin--dsl-context (dsl env)
      "File keyword handler.")

    (defun magin--dsl-file (dsl env)
      "File keyword handler.")

    (defun magin--dsl-block (dsl env)
      "Block keyword handler.")

    (magin--compiler
     `(context
       (file "a")
       (block emacs)
       (unknown) ;; Error, no `magit--dsl-unknown'
       ))
  #+END_SRC

  In the example above, the compiler finds the three functions above and
  calls them but fails on the last one. So if you want to extend it
  without messing with the source, one can simply define a function with
  the prefix and it will be detected by the compiler. This is similar to
  how =use-package= does it with its keywords. A global dependency
  injection if you will. This magic is done through =intern-soft=:

  #+BEGIN_SRC emacs-lisp
    (lexical-let* ((rule-name (symbol-name rule))
        (rule-handler
         (intern-soft
          (format "%s%s" magin-dsl-prefix rule-name))))
      (if (null rule-handler)
          (error "No rule to handle %s at dsl: %s" rule-name dsl)
        (funcall rule-handler dsl env)))
  #+END_SRC

  As a side note, you can use an =hash-map= or create your own =obarray=
  or symbol environemt if you really wanted a private space. In our
  approach, you can see the symbols with the helpful =describe-variable=
  without extra work.

  If you want to use =eval-sexp= with the raw DSL, you have to create
  your own =eval= and =env=. You can remap =eval= with =magin-compiler=,
  but you need to know when it is evaluating a DSL or a Lisp. We're not
  creating a new interpreter or environment, so this is good enough.

  With this simple mechanism, we can define the keywords incrementally.

* Context Keyword

  So our dispatcher is a function that takes a dsl and an environment
  which returns a text. Without the intermediate data structure, the
  context is applying the dispatcher to each line and then combining it
  with a newline delimiter as such:

  #+BEGIN_SRC emacs-lisp
    (string-join
     (mapcar  (lambda (subdsl)(funcall #'magin--compiler subdsl env)) subdsls)
     "\n")
  #+END_SRC

  This is simply lining up the entries. Nothing complicated but how
  about manipulating those that manipulate the environment?

* Environmental Keyword

  A quick way to create an environment like scoping, one can easily use
  an alist and it will take care of itself. For example with the
  =include= keyword:

  #+BEGIN_SRC emacs-lisp
    (lexical-let ((new-env (append (list (cons :include t)) env)))
      (magin--dsl-context dsl new-env))
  #+END_SRC

  You could use plist but have to implement an =extend= function for it.
  Interestingly, you could also use an alist to simulate an enviroment
  and lexical scoping without much problem.

  It is as simple as appending the =cons= entry and it is done. The
  others are implemented the same way. Now how about implementing the
  leaf keywords

* Leaf Keyword

  The implementation above forces everything to the leaf node which
  really have only one important one, =file=. The file has to take the
  text value and format it based on the environment.

  #+BEGIN_SRC emacs-lisp
    (lexical-let* ((parent (cdr (assoc :parent env)))
        (include (if (cdr (assoc :include env))"!" nil)))
      (concat include parent file))
  #+END_SRC

  Our friend is =assoc= and =cdr= when manipulating an alist enviroment.
  Again, it is simply a matter formatting. So writing a DSL with this
  setup is actually easy.

* Block Keyword

  Lastly, let's talk about defining a block variable. Like with the
  dispatcher, we can use the implicit Elisp environment as the variable
  space. No need to define a hash of symbols and lookups, we already
  have one and we take advantage of it. The keyword =defblock= will
  simply save the defintion into a symbol with a =magin--block-= prefix
  and the other one, =block=, looks for it. Aside from =intern-soft=,
  the complimentary friend is =makunbound=, which unbinds the symbol so
  the value is updated properly.

  #+BEGIN_SRC emacs-lisp
    (lexical-let* ((block-name (symbol-name block-symbol))
        (block-def-name (intern
                         (format "%s%s"
                                 magin-block-prefix
                                 block-name))))
      (makunbound block-def-name)
      (eval `(defvar ,block-def-name '(context ,@block-def)
               ,(format "Block definition for %s" block-name)))
      block-def-name)
  #+END_SRC

  Aside from using some direct =eval= magic, it is as straightforward as
  it gets as well as with the =block= handler. With this, we can have
  our resusable blocks of code.

  #+BEGIN_SRC emacs-lisp
    (magin--dsl-defblock
     `(defblock emacs
        (comment "Block for emacs")
        (file "*.elc")
        (file ".#*")
        (file "*Org Src*") ;; Org Src buffers
        )
     (list))
  #+END_SRC

