hacker/_posts/2017-01-25-A DSL For Git And Projectile Ignore File.html

<div id="outline-container-orgc89c476" class="outline-2">
<h2 id="orgc89c476">Keywords</h2>
<div class="outline-text-2" id="text-orgc89c476">
<p>
At last, we define our data structure:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">;; The leaf keywords
(file ,line)
(dir ,line) ;; Alias for file

;; Non functional nodes
(comment ,text)
(newline)


;; Syntactic grouping, the equivalent of progn
(context &amp;rest ,sublines)

;; Contextual grouping, like `context' but affects everything inside it
;; Sublines have the property `:include' as `t'
;; Which tells the leaf node to add `!' as a prefix
(include &amp;rest ,sublines)

;; Sublines have the property `:path' set to `path'
;; Nesting of paths are handled
(path ,path &amp;rest sublines)


;; Block keywords
;; Create a variable
(defblock ,block-name &amp;rest block-lines)

;; Call the variable
(block ,block-name)


;; Aesthetic grouping
;; Every subline is interleaved with a newline
(delimited &amp;rest ,sublines)
</pre>
</div>

<p>
Those are the keywords that we must handle in our DSL. With this in
mind, we can start be creating a function that handles the
compilation.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun magin--compiler (dsl &amp;optional env)
  "Compiles DSL with the environment ENV."
  nil)
</pre>
</div>

<p>
This is our DSL handler, every node that wants to compile nodes have
to go through this dispatching function. This setup allows us to add
more keywords independently of each other. However, we are not going
to use a long <code>switch</code> or <code>cond</code> statement; we will use the implicit
Elisp environment to find handlers. If the compiler comes to a
keyword, it finds a function in the Elisp environment that starts with
<code>magit--dsl-</code> and invokes that as a handler.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(defun magin--dsl-context (dsl env)
  "File keyword handler.")

(defun magin--dsl-file (dsl env)
  "File keyword handler.")

(defun magin--dsl-block (dsl env)
  "Block keyword handler.")

(magin--compiler
 `(context
   (file "a")
   (block emacs)
   (unknown) ;; Error, no `magit--dsl-unknown'
   ))
</pre>
</div>

<p>
In the example above, the compiler finds the three functions above and
calls them but fails on the last one. So if you want to extend it
without messing with the source, one can simply define a function with
the prefix and it will be detected by the compiler. This is similar to
how <code>use-package</code> does it with its keywords. A global dependency
injection if you will. This magic is done through <code>intern-soft</code>:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(lexical-let* ((rule-name (symbol-name rule))
    (rule-handler
     (intern-soft
      (format "%s%s" magin-dsl-prefix rule-name))))
  (if (null rule-handler)
      (error "No rule to handle %s at dsl: %s" rule-name dsl)
    (funcall rule-handler dsl env)))
</pre>
</div>

<p>
As a side note, you can use an <code>hash-map</code> or create your own <code>obarray</code>
or symbol environemt if you really wanted a private space. In our
approach, you can see the symbols with the helpful <code>describe-variable</code>
without extra work.
</p>

<p>
If you want to use <code>eval-sexp</code> with the raw DSL, you have to create
your own <code>eval</code> and <code>env</code>. You can remap <code>eval</code> with <code>magin-compiler</code>,
but you need to know when it is evaluating a DSL or a Lisp. We're not
creating a new interpreter or environment, so this is good enough.
</p>

<p>
With this simple mechanism, we can define the keywords incrementally.
</p>
</div>
</div>

<div id="outline-container-org87fcf52" class="outline-2">
<h2 id="org87fcf52">Context Keyword</h2>
<div class="outline-text-2" id="text-org87fcf52">
<p>
So our dispatcher is a function that takes a dsl and an environment
which returns a text. Without the intermediate data structure, the
context is applying the dispatcher to each line and then combining it
with a newline delimiter as such:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(string-join
 (mapcar  (lambda (subdsl)(funcall #'magin--compiler subdsl env)) subdsls)
 "\n")
</pre>
</div>

<p>
This is simply lining up the entries. Nothing complicated but how
about manipulating those that manipulate the environment?
</p>
</div>
</div>

<div id="outline-container-orge865983" class="outline-2">
<h2 id="orge865983">Environmental Keyword</h2>
<div class="outline-text-2" id="text-orge865983">
<p>
A quick way to create an environment like scoping, one can easily use
an alist and it will take care of itself. For example with the
<code>include</code> keyword:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(lexical-let ((new-env (append (list (cons :include t)) env)))
  (magin--dsl-context dsl new-env))
</pre>
</div>

<p>
You could use plist but have to implement an <code>extend</code> function for it.
Interestingly, you could also use an alist to simulate an enviroment
and lexical scoping without much problem.
</p>

<p>
It is as simple as appending the <code>cons</code> entry and it is done. The
others are implemented the same way. Now how about implementing the
leaf keywords
</p>
</div>
</div>

<div id="outline-container-orgdfc9967" class="outline-2">
<h2 id="orgdfc9967">Leaf Keyword</h2>
<div class="outline-text-2" id="text-orgdfc9967">
<p>
The implementation above forces everything to the leaf node which
really have only one important one, <code>file</code>. The file has to take the
text value and format it based on the environment.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(lexical-let* ((parent (cdr (assoc :parent env)))
    (include (if (cdr (assoc :include env))"!" nil)))
  (concat include parent file))
</pre>
</div>

<p>
Our friend is <code>assoc</code> and <code>cdr</code> when manipulating an alist enviroment.
Again, it is simply a matter formatting. So writing a DSL with this
setup is actually easy.
</p>
</div>
</div>

<div id="outline-container-orgc8a42fb" class="outline-2">
<h2 id="orgc8a42fb">Block Keyword</h2>
<div class="outline-text-2" id="text-orgc8a42fb">
<p>
Lastly, let's talk about defining a block variable. Like with the
dispatcher, we can use the implicit Elisp environment as the variable
space. No need to define a hash of symbols and lookups, we already
have one and we take advantage of it. The keyword <code>defblock</code> will
simply save the defintion into a symbol with a <code>magin--block-</code> prefix
and the other one, <code>block</code>, looks for it. Aside from <code>intern-soft</code>,
the complimentary friend is <code>makunbound</code>, which unbinds the symbol so
the value is updated properly.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(lexical-let* ((block-name (symbol-name block-symbol))
    (block-def-name (intern
                     (format "%s%s"
                             magin-block-prefix
                             block-name))))
  (makunbound block-def-name)
  (eval `(defvar ,block-def-name '(context ,@block-def)
           ,(format "Block definition for %s" block-name)))
  block-def-name)
</pre>
</div>

<p>
Aside from using some direct <code>eval</code> magic, it is as straightforward as
it gets as well as with the <code>block</code> handler. With this, we can have
our resusable blocks of code.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(magin--dsl-defblock
 `(defblock emacs
    (comment "Block for emacs")
    (file "*.elc")
    (file ".#*")
    (file "*Org Src*") ;; Org Src buffers
    )
 (list))
</pre>
</div>
</div>
</div>
