hacker/_posts/2017-01-25-A DSL For Git And Projectile Ignore File.org
* Non-functional Keyword

  The least important is the non-functional ones, like with =comment=
  and =newline= which are prefixed text and an empty text respectively.
  However, the =delimited= keyword is a bit more complex that it
  interleaves each line with a =newline= keyword.

  #+BEGIN_SRC emacs-lisp
    (lexical-let ((delimited-dsls
         (cdr
          (apply #'append
             (mapcar
              (lambda (dsl)
                (list '(newline) dsl))
              subdsls)))))
      (magin--compiler
       `(context
         ,@delimited-dsls)
       env))
  #+END_SRC

  Take your pick in implementing =interleave= but the thing here is that
  it wraps the old context with a newly modified one. It may not be a
  big thing but this interferes with debugging and tracing when you
  don't know the original source. This is one weakness of this approach
  that it interferes with the dsl itself. Nothing terrible but it is the
  price of having the return value as text instead of an intermediate
  value.

  With all those ideas, the DSL is easily implemented.

* Wrap Up

  So with this design and implementation we have a crud but simple and
  dynamic DSL. You can look at the main defintion and notice the use of
  backquoting in how it addresses the problems mentioned. Now I can
  manage my ignore file with Emacs.

  Now for some minor things we might have forgotten:

  - Unit tests
  - Logging
  - Debugging

  The DSL is not too complex to warrant any of those but it is nice to
  note and implement. As one final point, we could have used a
  =defmacro= instead of a dispatch compiler but in case we want to
  update our code in order to join other contexts, we have a base.

  #+BEGIN_SRC emacs-lisp
    (setq left-code `(context
                   (file "a")
                   (file "b"))
       right-code `(context
                    (file "c")
                    (file "d")))


    (magin-join left-code right-code) ;; ???
  #+END_SRC

  If we are dealing with text, we can't have this yet. In particular if
  you have an initial defintion and want to update it according some
  condition, then it requires changing the code to handle plist or
  something that fancies the data.

  To reiterate, Elisp allows us to create a DSL with ease and little
  knowledge.

* Conclusion

  So I copied this code to create =projin= for =projectile= ignore file
  but unless I need more functionality, I don't think I need it for now.
  If another ignore file comes my way, I might refactor and do the same.

  The one thing I want to really write is a DSL for SQL writing, not SQL
  itself. My dream is to write SQL as blocks of data.

  #+BEGIN_SRC emacs-lisp
    (setq display-fields '(fields first-name last-name middle-name))

    (select
     display-fields
     (from table))
    ;; "SELECT firstName, lastName, middleName FROM table"

  #+END_SRC

  The idea in that snippet is the fields are data itself. It also
  extends to queries being data but the abstraction of aliasing and
  joining is sketchy for now. That is my dream though: to write a DSL
  for SQL writing. For now, ignore files are good practice.
