hacker/_posts/2017-01-25-A DSL For Git And Projectile Ignore File.html

<div id="outline-container-org860ae33" class="outline-2">
<h2 id="org860ae33">Non-functional Keyword</h2>
<div class="outline-text-2" id="text-org860ae33">
<p>
The least important is the non-functional ones, like with <code>comment</code>
and <code>newline</code> which are prefixed text and an empty text respectively.
However, the <code>delimited</code> keyword is a bit more complex that it
interleaves each line with a <code>newline</code> keyword.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(lexical-let ((delimited-dsls
     (cdr
      (apply #'append
         (mapcar
          (lambda (dsl)
            (list '(newline) dsl))
          subdsls)))))
  (magin--compiler
   `(context
     ,@delimited-dsls)
   env))
</pre>
</div>

<p>
Take your pick in implementing <code>interleave</code> but the thing here is that
it wraps the old context with a newly modified one. It may not be a
big thing but this interferes with debugging and tracing when you
don't know the original source. This is one weakness of this approach
that it interferes with the dsl itself. Nothing terrible but it is the
price of having the return value as text instead of an intermediate
value.
</p>

<p>
With all those ideas, the DSL is easily implemented.
</p>
</div>
</div>

<div id="outline-container-orgfb3dfe6" class="outline-2">
<h2 id="orgfb3dfe6">Wrap Up</h2>
<div class="outline-text-2" id="text-orgfb3dfe6">
<p>
So with this design and implementation we have a crud but simple and
dynamic DSL. You can look at the main defintion and notice the use of
backquoting in how it addresses the problems mentioned. Now I can
manage my ignore file with Emacs.
</p>

<p>
Now for some minor things we might have forgotten:
</p>

<ul class="org-ul">
<li>Unit tests</li>
<li>Logging</li>
<li>Debugging</li>
</ul>

<p>
The DSL is not too complex to warrant any of those but it is nice to
note and implement. As one final point, we could have used a
<code>defmacro</code> instead of a dispatch compiler but in case we want to
update our code in order to join other contexts, we have a base.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq left-code `(context
               (file "a")
               (file "b"))
   right-code `(context
                (file "c")
                (file "d")))


(magin-join left-code right-code) ;; ???
</pre>
</div>

<p>
If we are dealing with text, we can't have this yet. In particular if
you have an initial defintion and want to update it according some
condition, then it requires changing the code to handle plist or
something that fancies the data.
</p>

<p>
To reiterate, Elisp allows us to create a DSL with ease and little
knowledge.
</p>
</div>
</div>

<div id="outline-container-org9fbf889" class="outline-2">
<h2 id="org9fbf889">Conclusion</h2>
<div class="outline-text-2" id="text-org9fbf889">
<p>
So I copied this code to create <code>projin</code> for <code>projectile</code> ignore file
but unless I need more functionality, I don't think I need it for now.
If another ignore file comes my way, I might refactor and do the same.
</p>

<p>
The one thing I want to really write is a DSL for SQL writing, not SQL
itself. My dream is to write SQL as blocks of data.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(setq display-fields '(fields first-name last-name middle-name))

(select
 display-fields
 (from table))
;; "SELECT firstName, lastName, middleName FROM table"
</pre>
</div>

<p>
The idea in that snippet is the fields are data itself. It also
extends to queries being data but the abstraction of aliasing and
joining is sketchy for now. That is my dream though: to write a DSL
for SQL writing. For now, ignore files are good practice.
</p>
</div>
</div>
